export const tileMapping = {
    101: '1筒', 102: '2筒', 103: '3筒', 104: '4筒', 105: '5筒', 106: '6筒', 107: '7筒', 108: '8筒', 109: '9筒',
    201: '1條', 202: '2條', 203: '3條', 204: '4條', 205: '5條', 206: '6條', 207: '7條', 208: '8條', 209: '9條',
    301: '1萬', 302: '2萬', 303: '3萬', 304: '4萬', 305: '5萬', 306: '6萬', 307: '7萬', 308: '8萬', 309: '9萬',
    1: '東', 3: '南', 5: '西', 7: '北',
    11: '中', 13: '發', 15: '白',
    21: '春', 23: '夏', 25: '秋', 27: '冬',
    31: '梅', 33: '蘭', 35: '菊', 37: '竹',
};


export const tiles = {
    tungzi: [101, 102, 103, 104, 105, 106, 107, 108, 109],  // 筒子: 1筒 to 9筒
    sokzi: [201, 202, 203, 204, 205, 206, 207, 208, 209],  // 條: 1條 to 9條
    maanzi: [301, 302, 303, 304, 305, 306, 307, 308, 309],  // 萬子: 1萬 to 9萬
    faanzi: [1, 3, 5, 7, 11, 13, 15],  // 番子: 東, 南, 西, 北, 中, 發, 白
    winds: [1, 3, 5, 7], //東風, 南風, 西風, 北風
    dragons: [11, 13, 15], //中, 發, 白
    flowers: [21, 23, 25, 27, 31, 33, 35, 37]// 花: 春, 夏, 秋, 冬
};

export const patterns = {
//     "無花"
// "正花"
// "爛花"
// "番子"
// "無字"
// "雞胡"
// "對碰"
// "假獨"
// "獨獨"
// DONE "平胡"
// DONE "將眼"
// "老少"
// DONE "無字"
// "無字花"
// "無字花大平糊"
// DONE "門清"
// "海底撈月"
// "自摸"
// "門清自摸"
// "明摃"
// "暗摃"
// DONE "二暗刻"
// DONE "三暗刻"
// DONE "四暗刻"
"一般高": ["一般高", 3],
"三般高": ["三般高", 10],
"四般高": ["四般高", 30],
// "二相逢"
// "三相逢"
// "四同順"
// "五同順"
// "二兄弟"
// "小三兄弟"
// "大三兄弟"
"小三姊妹": ["小三姊妹", 8],
"大三姊妹": ["大三姊妹", 15],
// "四歸一"
// "四歸二"
// "四歸四"
"明清龍" : ["明清龍", 10],
"暗清龍" : ["暗清龍", 20],
// "明雜龍"
// "暗雜龍"
// 五門齊
// "缺一門"
// DONE "混一色"
// DONE "清一色"
// DONE "對對胡"
// "全求人"
// "半求人"
// DONE "小三元"
// DONE "大三元"
// DONE "小三風"
// DONE "大三風"
// DONE "小四喜"
// DONE "大四喜"
// DONE "十三么"
// DONE "十六不搭"
// DONE "五暗刻"
// "間間胡"
// DONE "嚦咕嚦咕"
// "斷么"
// "全帶混么"
// "全帶么"
// "混么"
// "清么"
}